In [2]:
import pandas as pd
print(pd.__version__)

1.4.4

In [3]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [8]:
#creating a dictionary
mydataset = {'car': ["Tesla", "Audi", "BMW"],
             'year of make': [2004, 2007, 2020]
            }
#accessing the dictionary
myvar = pd.DataFrame(mydataset)
print(myvar)

     car  year of make
0  Tesla          2004
1   Audi          2007

In [9]:
#creating a tuple
colours = ("red","green","blue")
cl = pd.DataFrame(colours)
print(cl)

       0
0    red
1  green
2   blue

In [10]:
#creating a list using series
#series are single dimension array
#only columns
df = pd.Series([1,3,"Martha", 44, "Hellen"])
print(df)

0         1
1         3
2    Martha
3        44
4    Hellen
dtype: object

In [11]:
#creating a list
df = pd.DataFrame([1,3,"Martha", 44, "Hellen"])
print(df)

        0
0       1
1       3
2  Martha
3      44
4  Hellen

In [28]:
#creating a dictionary showing dates and days
#using tail()and head() to print last and first resp
mydic = {'day': ["Monday", "Tuesday", "Wednesday", "Thursday","Friday"],
             'date': ["01/01/2000","02/01/2000", "03/01/2000","04/01/2000","05/01/2000"]
            }
#accessing the dictionary
Dic = pd.Series(mydic)
print(Dic)

day        [Monday, Tuesday, Wednesday, Thursday, Friday]
date    [01/01/2000, 02/01/2000, 03/01/2000, 04/01/200...
dtype: object

In [30]:
dic = pd.DataFrame(mydic)
two = dic.head(n=2)
print(two)
#changing to series
print("-------------")
series = two.squeeze()
print(series)

       day        date
0   Monday  01/01/2000
1  Tuesday  02/01/2000
-------------
       day        date
0   Monday  01/01/2000
1  Tuesday  02/01/2000

Shoes ={
    "brand": "Nick",
    "color": "black",
    "size": 40
}
df1 = pd.Series(Shoes)
print(df1)
print(df1["brand"])


## Assignment for the two data sets
## exercise 1

Analyse and clean the data

In [8]:
#Loading the data set
df_1 = pd. read_csv('mine.csv')
df_1

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [9]:
df_2 = pd. read_csv('work.csv')
df_2

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

 1. Using head() method

In [10]:
#Using it on the 1st dataset
df_1.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [11]:
#Using it on the 2nd dataset
df_2.head()

     Name         city  age py-score
0    Emma      Kampala   23       90
1  Wilber        Mbale   26       75
2   Robin         Gulu   25     mine
3   Tevor  Livingstone  NaN       89
4    Yeko       Tororo   20       94

2. Using the tail() method

In [12]:
#Using it on the 1st dataset
df_1.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [13]:
#Using it on the 2nd dataset
df_2.tail()

     Name         city    age py-score
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

3. Using the info() method

In [14]:
#Using it on the 1st dataset
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [16]:
#Using it on the 2nd dataset
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      7 non-null      object
 1   city      7 non-null      object
 2   age       6 non-null      object
 3   py-score  6 non-null      object
dtypes: object(4)
memory usage: 352.0+ bytes

4. Using dropna() method

In [17]:
#Using it on the 1st dataset
df_1.dropna()

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [18]:
#Using it on the 2nd dataset
df_2.dropna()

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

5. Using the fillna() method

In [23]:
#Using it on the 1st dataset -> fill missing values with specific value
print(df_1.fillna(0))

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [24]:
#Using it on the 2nd dataset
df_2.fillna(0)

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone      0       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train        0
6   Jesca      Mbarara     21       84

# #Exercise 2

1. Remove Wrong data

In [28]:
#removing all null values from the data because we consider them wrong data
#data set 1
filter_1 = df_1.dropna()
print(filter_1)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

In [27]:
#removing from the second dataset
filter_2 = df_2.dropna()
print(filter_2)

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

2. Removing wrong formats

In [53]:
# Identify the wrong data formats (e.g., non-numeric values in a numeric column)
condition_1 = ~df_1['Duration'].astype(str).str.isnumeric()

# Remove rows with wrong data formats
filtered_df1 = df_1[~condition_1]
print(filtered_df1)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [42]:
# Identify the wrong data formats (e.g., non-numeric values in a numeric column)
condition_2 =(~df_2['py-score'].astype(str).str.isnumeric()) | (~df_2['age'].astype(str).str.isnumeric())

# Remove rows with wrong data formats
filtered_df2 = df_2[~condition_2]
print(filtered_df2)

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

3. Removing duplicates

In [55]:
#dropping duplicates from the filtered files
no_dupes1 =filtered_df1.drop_duplicates()
print(no_dupes1)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[162 rows x 4 columns]

In [56]:
no_dupes2 = filtered_df2.drop_duplicates()
print(no_dupes2)

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

4. Perform some correlation

In [57]:
#performing correlation on the 1st
no_dupes1.corr()

          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.162098  0.003578  0.923053
Pulse    -0.162098  1.000000  0.787035  0.015301
Maxpulse  0.003578  0.787035  1.000000  0.195309
Calories  0.923053  0.015301  0.195309  1.000000

In [59]:
#performing correlation on the 2nd
no_dupes2.corr()

Empty DataFrame
Columns: []
Index: []